; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p8---int100n150-m25---int100c150---s183---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level17 level17)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level17 level18)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level17 level19)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level17 level20)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level17 level21)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level17 level22)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level17 level23)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level17 level24)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level17 level25)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level17 level26)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level17 level27)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level17 level28)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level17 level29)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level13 level17 level30)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level14 level17 level31)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level15 level17 level32)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level16 level17 level33)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level17 level17 level34)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level18 level17 level35)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level19 level17 level36)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level20 level17 level37)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level21 level17 level38)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level22 level17 level39)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level23 level17 level40)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level24 level17 level41)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level12 level37)
(sum level25 level17 level42)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level12 level38)
(sum level26 level17 level43)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level12 level39)
(sum level27 level17 level44)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level12 level40)
(sum level28 level17 level45)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level12 level41)
(sum level29 level17 level46)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level12 level42)
(sum level30 level17 level47)
(sum level30 level25 level55)
(sum level31 level3 level34)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level12 level43)
(sum level31 level17 level48)
(sum level31 level25 level56)
(sum level32 level3 level35)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level12 level44)
(sum level32 level17 level49)
(sum level32 level25 level57)
(sum level33 level3 level36)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level12 level45)
(sum level33 level17 level50)
(sum level33 level25 level58)
(sum level34 level3 level37)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level12 level46)
(sum level34 level17 level51)
(sum level34 level25 level59)
(sum level35 level3 level38)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level12 level47)
(sum level35 level17 level52)
(sum level35 level25 level60)
(sum level36 level3 level39)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level12 level48)
(sum level36 level17 level53)
(sum level36 level25 level61)
(sum level37 level3 level40)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level12 level49)
(sum level37 level17 level54)
(sum level37 level25 level62)
(sum level38 level3 level41)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level12 level50)
(sum level38 level17 level55)
(sum level38 level25 level63)
(sum level39 level3 level42)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level12 level51)
(sum level39 level17 level56)
(sum level39 level25 level64)
(sum level40 level3 level43)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level12 level52)
(sum level40 level17 level57)
(sum level40 level25 level65)
(sum level41 level3 level44)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level12 level53)
(sum level41 level17 level58)
(sum level41 level25 level66)
(sum level42 level3 level45)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level12 level54)
(sum level42 level17 level59)
(sum level42 level25 level67)
(sum level43 level3 level46)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level12 level55)
(sum level43 level17 level60)
(sum level43 level25 level68)
(sum level44 level3 level47)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level12 level56)
(sum level44 level17 level61)
(sum level44 level25 level69)
(sum level45 level3 level48)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level12 level57)
(sum level45 level17 level62)
(sum level45 level25 level70)
(sum level46 level3 level49)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level12 level58)
(sum level46 level17 level63)
(sum level46 level25 level71)
(sum level47 level3 level50)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level12 level59)
(sum level47 level17 level64)
(sum level47 level25 level72)
(sum level48 level3 level51)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level12 level60)
(sum level48 level17 level65)
(sum level48 level25 level73)
(sum level49 level3 level52)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level12 level61)
(sum level49 level17 level66)
(sum level49 level25 level74)
(sum level50 level3 level53)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level12 level62)
(sum level50 level17 level67)
(sum level50 level25 level75)
(sum level51 level3 level54)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level51 level12 level63)
(sum level51 level17 level68)
(sum level51 level25 level76)
(sum level52 level3 level55)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level10 level62)
(sum level52 level11 level63)
(sum level52 level12 level64)
(sum level52 level17 level69)
(sum level52 level25 level77)
(sum level53 level3 level56)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level10 level63)
(sum level53 level11 level64)
(sum level53 level12 level65)
(sum level53 level17 level70)
(sum level53 level25 level78)
(sum level54 level3 level57)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level10 level64)
(sum level54 level11 level65)
(sum level54 level12 level66)
(sum level54 level17 level71)
(sum level54 level25 level79)
(sum level55 level3 level58)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level10 level65)
(sum level55 level11 level66)
(sum level55 level12 level67)
(sum level55 level17 level72)
(sum level55 level25 level80)
(sum level56 level3 level59)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level10 level66)
(sum level56 level11 level67)
(sum level56 level12 level68)
(sum level56 level17 level73)
(sum level56 level25 level81)
(sum level57 level3 level60)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level10 level67)
(sum level57 level11 level68)
(sum level57 level12 level69)
(sum level57 level17 level74)
(sum level57 level25 level82)
(sum level58 level3 level61)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level10 level68)
(sum level58 level11 level69)
(sum level58 level12 level70)
(sum level58 level17 level75)
(sum level58 level25 level83)
(sum level59 level3 level62)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level10 level69)
(sum level59 level11 level70)
(sum level59 level12 level71)
(sum level59 level17 level76)
(sum level59 level25 level84)
(sum level60 level3 level63)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level10 level70)
(sum level60 level11 level71)
(sum level60 level12 level72)
(sum level60 level17 level77)
(sum level60 level25 level85)
(sum level61 level3 level64)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level10 level71)
(sum level61 level11 level72)
(sum level61 level12 level73)
(sum level61 level17 level78)
(sum level61 level25 level86)
(sum level62 level3 level65)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level10 level72)
(sum level62 level11 level73)
(sum level62 level12 level74)
(sum level62 level17 level79)
(sum level62 level25 level87)
(sum level63 level3 level66)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level10 level73)
(sum level63 level11 level74)
(sum level63 level12 level75)
(sum level63 level17 level80)
(sum level63 level25 level88)
(sum level64 level3 level67)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level64 level10 level74)
(sum level64 level11 level75)
(sum level64 level12 level76)
(sum level64 level17 level81)
(sum level64 level25 level89)
(sum level65 level3 level68)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level65 level10 level75)
(sum level65 level11 level76)
(sum level65 level12 level77)
(sum level65 level17 level82)
(sum level65 level25 level90)
(sum level66 level3 level69)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level66 level10 level76)
(sum level66 level11 level77)
(sum level66 level12 level78)
(sum level66 level17 level83)
(sum level66 level25 level91)
(sum level67 level3 level70)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level9 level76)
(sum level67 level10 level77)
(sum level67 level11 level78)
(sum level67 level12 level79)
(sum level67 level17 level84)
(sum level67 level25 level92)
(sum level68 level3 level71)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level9 level77)
(sum level68 level10 level78)
(sum level68 level11 level79)
(sum level68 level12 level80)
(sum level68 level17 level85)
(sum level68 level25 level93)
(sum level69 level3 level72)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level9 level78)
(sum level69 level10 level79)
(sum level69 level11 level80)
(sum level69 level12 level81)
(sum level69 level17 level86)
(sum level69 level25 level94)
(sum level70 level3 level73)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level9 level79)
(sum level70 level10 level80)
(sum level70 level11 level81)
(sum level70 level12 level82)
(sum level70 level17 level87)
(sum level70 level25 level95)
(sum level71 level3 level74)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level9 level80)
(sum level71 level10 level81)
(sum level71 level11 level82)
(sum level71 level12 level83)
(sum level71 level17 level88)
(sum level71 level25 level96)
(sum level72 level3 level75)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level72 level9 level81)
(sum level72 level10 level82)
(sum level72 level11 level83)
(sum level72 level12 level84)
(sum level72 level17 level89)
(sum level72 level25 level97)
(sum level73 level3 level76)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level73 level9 level82)
(sum level73 level10 level83)
(sum level73 level11 level84)
(sum level73 level12 level85)
(sum level73 level17 level90)
(sum level74 level3 level77)
(sum level74 level6 level80)
(sum level74 level8 level82)
(sum level74 level9 level83)
(sum level74 level10 level84)
(sum level74 level11 level85)
(sum level74 level12 level86)
(sum level74 level17 level91)
(sum level75 level3 level78)
(sum level75 level6 level81)
(sum level75 level8 level83)
(sum level75 level9 level84)
(sum level75 level10 level85)
(sum level75 level11 level86)
(sum level75 level12 level87)
(sum level75 level17 level92)
(sum level76 level3 level79)
(sum level76 level6 level82)
(sum level76 level8 level84)
(sum level76 level9 level85)
(sum level76 level10 level86)
(sum level76 level11 level87)
(sum level76 level12 level88)
(sum level76 level17 level93)
(sum level77 level3 level80)
(sum level77 level6 level83)
(sum level77 level8 level85)
(sum level77 level9 level86)
(sum level77 level10 level87)
(sum level77 level11 level88)
(sum level77 level12 level89)
(sum level77 level17 level94)
(sum level78 level3 level81)
(sum level78 level6 level84)
(sum level78 level8 level86)
(sum level78 level9 level87)
(sum level78 level10 level88)
(sum level78 level11 level89)
(sum level78 level12 level90)
(sum level78 level17 level95)
(sum level79 level3 level82)
(sum level79 level6 level85)
(sum level79 level8 level87)
(sum level79 level9 level88)
(sum level79 level10 level89)
(sum level79 level11 level90)
(sum level79 level12 level91)
(sum level79 level17 level96)
(sum level80 level3 level83)
(sum level80 level6 level86)
(sum level80 level8 level88)
(sum level80 level9 level89)
(sum level80 level10 level90)
(sum level80 level11 level91)
(sum level80 level12 level92)
(sum level80 level17 level97)
(sum level81 level3 level84)
(sum level81 level6 level87)
(sum level81 level8 level89)
(sum level81 level9 level90)
(sum level81 level10 level91)
(sum level81 level11 level92)
(sum level81 level12 level93)
(sum level82 level3 level85)
(sum level82 level6 level88)
(sum level82 level8 level90)
(sum level82 level9 level91)
(sum level82 level10 level92)
(sum level82 level11 level93)
(sum level82 level12 level94)
(sum level83 level3 level86)
(sum level83 level6 level89)
(sum level83 level8 level91)
(sum level83 level9 level92)
(sum level83 level10 level93)
(sum level83 level11 level94)
(sum level83 level12 level95)
(sum level84 level3 level87)
(sum level84 level6 level90)
(sum level84 level8 level92)
(sum level84 level9 level93)
(sum level84 level10 level94)
(sum level84 level11 level95)
(sum level84 level12 level96)
(sum level85 level3 level88)
(sum level85 level6 level91)
(sum level85 level8 level93)
(sum level85 level9 level94)
(sum level85 level10 level95)
(sum level85 level11 level96)
(sum level85 level12 level97)
(sum level86 level3 level89)
(sum level86 level6 level92)
(sum level86 level8 level94)
(sum level86 level9 level95)
(sum level86 level10 level96)
(sum level86 level11 level97)
(sum level87 level3 level90)
(sum level87 level6 level93)
(sum level87 level8 level95)
(sum level87 level9 level96)
(sum level87 level10 level97)
(sum level88 level3 level91)
(sum level88 level6 level94)
(sum level88 level8 level96)
(sum level88 level9 level97)
(sum level89 level3 level92)
(sum level89 level6 level95)
(sum level89 level8 level97)
(sum level90 level3 level93)
(sum level90 level6 level96)
(sum level91 level3 level94)
(sum level91 level6 level97)
(sum level92 level3 level95)
(sum level93 level3 level96)
(sum level94 level3 level97)

(connected l0 l3)
(fuelcost level25 l0 l3)
(connected l0 l4)
(fuelcost level8 l0 l4)
(connected l0 l6)
(fuelcost level10 l0 l6)
(connected l1 l3)
(fuelcost level3 l1 l3)
(connected l1 l4)
(fuelcost level12 l1 l4)
(connected l1 l5)
(fuelcost level9 l1 l5)
(connected l2 l5)
(fuelcost level6 l2 l5)
(connected l3 l0)
(fuelcost level25 l3 l0)
(connected l3 l1)
(fuelcost level3 l3 l1)
(connected l4 l0)
(fuelcost level8 l4 l0)
(connected l4 l1)
(fuelcost level12 l4 l1)
(connected l4 l5)
(fuelcost level8 l4 l5)
(connected l4 l6)
(fuelcost level11 l4 l6)
(connected l5 l1)
(fuelcost level9 l5 l1)
(connected l5 l2)
(fuelcost level6 l5 l2)
(connected l5 l4)
(fuelcost level8 l5 l4)
(connected l5 l6)
(fuelcost level17 l5 l6)
(connected l6 l0)
(fuelcost level10 l6 l0)
(connected l6 l4)
(fuelcost level11 l6 l4)
(connected l6 l5)
(fuelcost level17 l6 l5)

(at t0 l2)
(fuel t0 level97)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l3)
(at p4 l3)
(at p5 l3)
(at p6 l1)
(at p7 l3)
)

(:goal
(and
(at p0 l0)
(at p1 l4)
(at p2 l6)
(at p3 l6)
(at p4 l1)
(at p5 l5)
(at p6 l4)
(at p7 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l2 l5 level91 level6 level97)
   deleted: (at t0 l2) (fuel t0 level97)
   added: (at t0 l5) (fuel t0 level91)
   goals met: 0 of 8
2. (drive t0 l5 l1 level82 level9 level91)
   deleted: (at t0 l5) (fuel t0 level91)
   added: (at t0 l1) (fuel t0 level82)
   goals met: 0 of 8
3. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 8
4. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 8
5. (drive t0 l1 l3 level79 level3 level82)
   deleted: (at t0 l1) (fuel t0 level82)
   added: (at t0 l3) (fuel t0 level79)
   goals met: 0 of 8
6. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 8
7. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 8
8. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 8
9. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 8
10. (drive t0 l3 l0 level54 level25 level79)
   deleted: (at t0 l3) (fuel t0 level79)
   added: (at t0 l0) (fuel t0 level54)
   goals met: 0 of 8
11. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 1 of 8
12. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 1 of 8
13. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 8
14. (drive t0 l0 l4 level46 level8 level54)
   deleted: (at t0 l0) (fuel t0 level54)
   added: (at t0 l4) (fuel t0 level46)
   goals met: 1 of 8
15. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 2 of 8
16. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 3 of 8
17. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 4 of 8
18. (drive t0 l4 l1 level34 level12 level46)
   deleted: (at t0 l4) (fuel t0 level46)
   added: (at t0 l1) (fuel t0 level34)
   goals met: 4 of 8
19. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 5 of 8
20. (drive t0 l1 l5 level25 level9 level34)
   deleted: (at t0 l1) (fuel t0 level34)
   added: (at t0 l5) (fuel t0 level25)
   goals met: 5 of 8
21. (unload p5 t0 l5)
   deleted: (in p5 t0)
   added: (at p5 l5)
   goals met: 6 of 8
22. (drive t0 l5 l6 level8 level17 level25)
   deleted: (at t0 l5) (fuel t0 level25)
   added: (at t0 l6) (fuel t0 level8)
   goals met: 6 of 8
23. (unload p2 t0 l6)
   deleted: (in p2 t0)
   added: (at p2 l6)
   goals met: 7 of 8
24. (unload p3 t0 l6)
   deleted: (in p3 t0)
   added: (at p3 l6)
   goals met: 8 of 8
